modules/core/base/Controller.php

SELECT * FROM `core_settings`
---
                function () {
                    return Settings::find()->all();