modules/tests/site/controllers/DefaultController.php

SELECT * FROM `test`
SELECT * FROM `test_user` WHERE `user_id`=11
---
    public function actionStart() {

        $test = Test::find()->one();

        $user_id = Yii::$app->user->identity->id;
        $test_user = TestUser::findOne([
                'user_id' => $user_id
            ]);