modules/departments/site/controllers/QuestionaryController.php

SELECT * FROM `questionary` WHERE `user_id`=11
---
    public function actionStart() {

        $user_id = Yii::$app->user->identity->id;

        $questionary = Questionary::findOne([
                'user_id' => $user_id
            ]);

SELECT * FROM `questionary` WHERE `user_id`=11
SELECT COUNT(*) FROM `department` WHERE `is_additional`=0
SELECT * FROM `department` WHERE `is_additional`=0
SELECT * FROM `user_specialization` WHERE (`user_id`=11) AND (`specialization_id`=1)
---
    public function actionProgress($step = -1)
    {
        $user_id = Yii::$app->user->identity->id;
        $questionary = Questionary::findOne([
                'user_id' => $user_id
            ]);
        if(is_null($questionary)) {
            return $this->redirect(Url::toRoute('/departments/questionary/start'));
        }

        $open_step = $questionary->open_step;
        if($step < 0 || $step >= $open_step) {
            $step = $open_step;
        }
        $count = Department::find()->where(['is_additional' => 0])->count();
        if($step < $count + 1) {
            $department = Department::find()->where(['is_additional' => 0])->offset($step)->one();

            $is_idea = false;
            if(is_null($department)) {
                $department = Department::find()->where(['icons' => 'idea'])->one();
                $is_idea = true;
            }
            $departments = Department::find()->where(['is_additional' => 0])->all();

            $specializations = Specialization::findAll(['department_id' => $department->id]);

            $is_check = false;
            $user_specializations = [];
            foreach($specializations as $specialization) {
                $user_specialization = UserSpecialization::findOne(
                    [
                        'user_id' => $user_id,
                        'specialization_id' => $specialization->id
                    ]
                );